ReactiveProgramming/PerformingTest/bank/reports/async-100ms-latency.out
____________________________________________________________
TEST with 500 threads on http://localhost:8080/async/bank-report/1
____________________________________________________________
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /async/bank-report/1
Document Length:        136 bytes

Concurrency Level:      500
Time taken for tests:   6.275 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      2550000 bytes
HTML transferred:       1360000 bytes
Requests per second:    1593.61 [#/sec] (mean)
Time per request:       313.752 [ms] (mean)
Time per request:       0.628 [ms] (mean, across all concurrent requests)
Transfer rate:          396.85 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    4   5.9      2      77
Processing:   190  303  59.6    296     790
Waiting:      190  299  58.4    294     789
Total:        199  307  59.7    299     815

Percentage of the requests served within a certain time (ms)
  50%    299
  66%    317
  75%    333
  80%    344
  90%    369
  95%    393
  98%    445
  99%    481
 100%    815 (longest request)
____________________________________________________________
TEST with 1000 threads on http://localhost:8080/async/bank-report/1
____________________________________________________________
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /async/bank-report/1
Document Length:        136 bytes

Concurrency Level:      1000
Time taken for tests:   6.544 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      2550000 bytes
HTML transferred:       1360000 bytes
Requests per second:    1528.12 [#/sec] (mean)
Time per request:       654.398 [ms] (mean)
Time per request:       0.654 [ms] (mean, across all concurrent requests)
Transfer rate:          380.54 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   11  75.5      2    1032
Processing:   117  600 100.3    608     858
Waiting:      117  596  98.7    606     858
Total:        168  611 121.0    613    1681

Percentage of the requests served within a certain time (ms)
  50%    613
  66%    652
  75%    669
  80%    680
  90%    714
  95%    747
  98%    790
  99%    832
 100%   1681 (longest request)